{"datasets/MVTec_Loco/breakfast_box/train/good/084.png": "On the left side of the image, there is one apple and two mandarins. On the right side of the image, there is granola, banana chips, and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/000.png": "On the left side of the image, there are three tangerines and one apple. \n\nOn the right side of the image, there is a combination of granola, almonds, and dried banana chips.", "datasets/MVTec_Loco/breakfast_box/test/good/001.png": "On the left side of the image, there are three whole fruits: two oranges and one peach or nectarine. On the right side of the image, there is granola, as well as a mix of dried banana slices and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/002.png": "On the left side of the image, there are three pieces of fruit: two oranges and one nectarine. On the right side of the image, there is granola at the top and a mixture of nuts and dried banana chips at the bottom.", "datasets/MVTec_Loco/breakfast_box/test/good/003.png": "On the left side of the image, there are two oranges and a peach. On the right side of the image, there is granola and a mixture of dried banana chips and nuts.", "datasets/MVTec_Loco/breakfast_box/test/good/004.png": "On the left side of the image, there are three fruits: a peach (or nectarine) and two clementines (or tangerines). On the right side, there is a mix of granola, almonds, and banana chips.", "datasets/MVTec_Loco/breakfast_box/test/good/005.png": "The image shows a food tray with two compartments. \n\n- On the left side of the image, there are three pieces of fruit: one peach and two mandarins.\n- On the right side of the image, there is a mixture of granola, slices of dried banana, and some almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/006.png": "In the image, the left side of the container contains two tangerines and one apple. The right side of the container has granola, banana chips, and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/007.png": "On the left side of the image, there is one peach and two mandarins or tangerines. On the right side of the image, there is granola on the upper part, and a mix of banana chips and almonds on the lower part.", "datasets/MVTec_Loco/breakfast_box/test/good/008.png": "In the image provided, on the left side, there is a section containing a peach and two tangerines. On the right side, there is a section containing granola, banana chips, and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/009.png": "The left side of the image contains three pieces of fruit: one peach (top) and two tangerines (bottom). The right side of the image contains a mix of granola, banana chips, and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/010.png": "On the left side of the image, there are three pieces of fruit: two oranges and one apple.\n\nOn the right side of the image, there is a pile of granola with dried banana slices and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/011.png": "- On the left side of the image, there are three fruits: two mandarin oranges (or similar citrus fruits) and one nectarine.\n- On the right side of the image, there is a pile of granola, which includes oats, dried banana chips, and some almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/012.png": "On the left side of the image, there are three whole fruits: two oranges and one peach or nectarine. On the right side of the image, there is a mixture of granola, nuts (such as almonds), and dried banana slices.", "datasets/MVTec_Loco/breakfast_box/test/good/013.png": "On the left side of the image, there are three fruits: two oranges and one nectarine. On the right side of the image, there is a mixture of granola and dried banana chips with some almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/014.png": "In the image, there are two sections clearly divided.\n\n- **Left Side:** There are three fruits. The two oranges are at the top and bottom, and in between them, there is a peach or nectarine.\n\n- **Right Side:** There is a mixture of granola, which includes oats and dried banana chips along with some nuts (such as almonds).\n\nThis appears to be a healthy snack or meal option, with fresh fruits on one side and granola with dried banana chips and nuts on the other.", "datasets/MVTec_Loco/breakfast_box/test/good/015.png": "The left side of the image contains three pieces of fruit: one peach and two tangerines. The right side of the image contains granola, sliced dried bananas, and whole almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/016.png": "On the left side of the image, there are two oranges and one nectarine/peach. \n\nOn the right side of the image, there is a mixture that appears to include granola and dried banana slices with almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/017.png": "On the left side of the image, there are three pieces of fruit: two oranges and one apple. On the right side of the image, there is a mixture of granola, sliced bananas, and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/018.png": "The left side of the image contains three pieces of fruit: one nectarine (or peach) and two mandarins (or clementines). The right side of the image contains a mix of granola, banana chips, and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/019.png": "On the left side of the image, there are three whole fruits: two tangerines and one apple. \n\nOn the right side of the image, there are compartments that contain granola, banana chips, and mixed nuts.", "datasets/MVTec_Loco/breakfast_box/test/good/020.png": "The left side of the image has three pieces of whole fruit: two tangerines and one nectarine. The right side of the image contains granola, along with a mix of almonds and banana chips.", "datasets/MVTec_Loco/breakfast_box/test/good/021.png": "In the image, the left side contains two small oranges and a peach. \n\nThe right side contains granola, dried bananas, and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/022.png": "The image depicts a food tray divided into two sections. \n\n- On the left side of the image, there are three whole fruit items: two oranges and one nectarine.\n- On the right side of the image, there is a mixture of granola with dried fruit and nuts, including banana chips and almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/023.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there are granola, dried banana chips, and some almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/024.png": "In the image, the left side of the tray contains three fruits: one large fruit at the top, which appears to be an apple, and two smaller fruits below it, which appear to be oranges. \n\nThe right side of the tray contains a mixture of granola, along with what looks like dried banana slices and whole almonds.", "datasets/MVTec_Loco/breakfast_box/test/good/025.png": "In the image, the left side of the container holds two oranges and one nectarine or peach. The right side of the container contains granola, sliced bananas, and almonds.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/000.png": "On the left side of the image, there is a mix of granola, dried banana slices, and almonds. On the right side of the image, there are three tangerines.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/001.png": "On the left side of the image, there is granola mixed with some nuts and banana chips. \n\nOn the right side of the image, there are two oranges and one nectarine.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/002.png": "On the left side of the image, there is a section containing granola, banana chips, and almonds.\n\nOn the right side of the image, there is a section containing two tangerines and a peach.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/003.png": "In the image, on the left side, there are three fruits: two oranges and one peach. On the right side, there is granola at the top and banana chips at the bottom. This appears to be a compartmentalized food tray with assorted healthy snacks.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/004.png": "On the left side of the image, there are two oranges and one peach. \n\nOn the right side of the image, there is granola (top section) and banana chips (bottom section).", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/005.png": "On the left side of the image, there are three fruits: two tangerines (or oranges) and one peach. On the right side of the image, there is granola at the top and banana chips at the bottom.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/006.png": "The left side of the image contains three whole fruits, specifically two mandarins/tangerines and one peach/nectarine. The right side of the image contains granola and sliced dried bananas.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/007.png": "On the left side of the image, there are three pieces of fruit, specifically two oranges and one peach. On the right side of the image, there are granola and banana chips.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/008.png": "The left side of the image contains a peach and two tangerines. The right side of the image has granola and banana chips.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/009.png": "On the left side of the image, there are two tangerines and one peach. On the right side of the image, there is a mix of granola and dried banana slices.", "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/010.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach. On the right side of the image, there is a mix of granola and banana chips. The food items are placed in a compartmentalized container."}