{
    "datasets/MVTec_Loco/breakfast_box/train/good/084.png": "On the left side of the image, there is one apple and two mandarins (can also be oranges or tangerines, clementines). On the right side of the image, there is granola, banana chips (or dried banana chip), and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/000.png": "On the left side of the image, there are three tangerines and one apple. \n\nOn the right side of the image, there is a combination of granola, almonds, and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/001.png": "On the left side of the image, there are three whole fruits: two oranges and one peach or nectarine. On the right side of the image, there is granola, as well as a mix of dried banana slices and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/002.png": "On the left side of the image, there are three pieces of fruit: two oranges and one nectarine. On the right side of the image, there is granola at the top and a mixture of nuts and dried banana chips at the bottom.",
    "datasets/MVTec_Loco/breakfast_box/test/good/003.png": "On the left side of the image, there are two oranges and a peach. On the right side of the image, there is granola and a mixture of dried banana chips and nuts.",
    "datasets/MVTec_Loco/breakfast_box/test/good/004.png": "On the left side of the image, there are three fruits: a peach (or nectarine) and two clementines (or tangerines). On the right side, there is a mix of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/005.png": "The image shows a food tray with two compartments. \n\n- On the left side of the image, there are three pieces of fruit: one peach and two mandarins.\n- On the right side of the image, there is a mixture of granola, slices of dried banana, and some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/006.png": "In the image, the left side of the container contains two tangerines and one apple. The right side of the container has granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/007.png": "On the left side of the image, there is one peach and two mandarins or tangerines. On the right side of the image, there is granola on the upper part, and a mix of banana chips and almonds on the lower part.",
    "datasets/MVTec_Loco/breakfast_box/test/good/008.png": "In the image provided, on the left side, there is a section containing a peach and two tangerines. On the right side, there is a section containing granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/009.png": "The left side of the image contains three pieces of fruit: one peach (top) and two tangerines (bottom). The right side of the image contains a mix of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/010.png": "On the left side of the image, there are three pieces of fruit: two oranges and one apple.\n\nOn the right side of the image, there is a pile of granola with dried banana slices and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/011.png": "- On the left side of the image, there are three fruits: two mandarin oranges (or similar citrus fruits) and one nectarine.\n- On the right side of the image, there is a pile of granola, which includes oats, dried banana chips, and some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/012.png": "On the left side of the image, there are three whole fruits: two oranges and one peach or nectarine. On the right side of the image, there is a mixture of granola, nuts (such as almonds), and dried banana slices.",
    "datasets/MVTec_Loco/breakfast_box/test/good/013.png": "On the left side of the image, there are three fruits: two oranges and one nectarine. On the right side of the image, there is a mixture of granola and dried banana chips with some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/014.png": "In the image, there are two sections clearly divided.\n\n- **Left Side:** There are three fruits. The two oranges are at the top and bottom, and in between them, there is a peach or nectarine.\n\n- **Right Side:** There is a mixture of granola, which includes oats and dried banana chips along with some nuts (such as almonds).\n\nThis appears to be a healthy snack or meal option, with fresh fruits on one side and granola with dried banana chips and nuts on the other.",
    "datasets/MVTec_Loco/breakfast_box/test/good/015.png": "The left side of the image contains three pieces of fruit: one peach and two tangerines. The right side of the image contains granola, sliced dried bananas, and whole almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/016.png": "On the left side of the image, there are two oranges and one nectarine/peach. \n\nOn the right side of the image, there is a mixture that appears to include granola and dried banana slices with almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/017.png": "On the left side of the image, there are three pieces of fruit: two oranges and one apple. On the right side of the image, there is a mixture of granola, sliced bananas, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/018.png": "The left side of the image contains three pieces of fruit: one nectarine (or peach) and two mandarins (or clementines). The right side of the image contains a mix of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/019.png": "On the left side of the image, there are three whole fruits: two tangerines and one apple. \n\nOn the right side of the image, there are compartments that contain granola, banana chips, and mixed nuts.",
    "datasets/MVTec_Loco/breakfast_box/test/good/020.png": "The left side of the image has three pieces of whole fruit: two tangerines and one nectarine. The right side of the image contains granola, along with a mix of almonds and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/021.png": "In the image, the left side contains two small oranges and a peach. \n\nThe right side contains granola, dried bananas, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/022.png": "The image depicts a food tray divided into two sections. \n\n- On the left side of the image, there are three whole fruit items: two oranges and one nectarine.\n- On the right side of the image, there is a mixture of granola with dried fruit and nuts, including banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/023.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there are granola, dried banana chips, and some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/024.png": "In the image, the left side of the tray contains three fruits: one large fruit at the top, which appears to be an apple, and two smaller fruits below it, which appear to be oranges. \n\nThe right side of the tray contains a mixture of granola, along with what looks like dried banana slices and whole almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/025.png": "In the image, the left side of the container holds two oranges and one nectarine or peach. The right side of the container contains granola, sliced bananas, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/000.png": "On the left side of the image, there is a mix of granola, dried banana slices, and almonds. On the right side of the image, there are three tangerines.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/001.png": "On the left side of the image, there is granola mixed with some nuts and banana chips. \n\nOn the right side of the image, there are two oranges and one nectarine.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/002.png": "On the left side of the image, there is a section containing granola, banana chips, and almonds.\n\nOn the right side of the image, there is a section containing two tangerines and a peach.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/003.png": "In the image, on the left side, there are three fruits: two oranges and one peach. On the right side, there is granola at the top and banana chips at the bottom. This appears to be a compartmentalized food tray with assorted healthy snacks.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/004.png": "On the left side of the image, there are two oranges and one peach. \n\nOn the right side of the image, there is granola (top section) and banana chips (bottom section).",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/005.png": "On the left side of the image, there are three fruits: two tangerines (or oranges) and one peach. On the right side of the image, there is granola at the top and banana chips at the bottom.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/006.png": "The left side of the image contains three whole fruits, specifically two mandarins/tangerines and one peach/nectarine. The right side of the image contains granola and sliced dried bananas.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/007.png": "On the left side of the image, there are three pieces of fruit, specifically two oranges and one peach. On the right side of the image, there are granola and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/008.png": "The left side of the image contains a peach and two tangerines. The right side of the image has granola and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/009.png": "On the left side of the image, there are two tangerines and one peach. On the right side of the image, there is a mix of granola and dried banana slices.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/010.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach. On the right side of the image, there is a mix of granola and banana chips. The food items are placed in a compartmentalized container.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/011.png": "On the left side of the image, there are three whole fruits: two tangerines and a peach. \n\nOn the right side of the image, there are granola and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/012.png": "On the left side of the image, there are two tangerines and one peach. \n\nOn the right side of the image, there is granola in the upper section and dried banana chips in the lower section.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/013.png": "The left side of the image contains three citrus fruits, such as oranges or tangerines. The right side of the image contains granola and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/014.png": "In the image, the left side contains three pieces of fruit: two oranges and one nectarine. The right side contains a mixture of granola and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/015.png": "On the left side of the image, there are three types of fruit: two tangerines and one peach or nectarine. On the right side of the image, there is granola and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/016.png": "On the left side of the image, there are three oranges and a peach. On the right side of the image, there is a granola-like mixture and a pile of almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/017.png": "The left side of the image contains two tangerines and one apple. The right side of the image contains granola and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/018.png": "In the image, the left side contains three pieces of fruit, specifically two oranges and one nectarine. The right side contains a mix of granola and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/019.png": "On the left side of the image, there are three fruits: two oranges and one nectarine. On the right side of the image, there are granola and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/020.png": "The image shows a tray that appears to be divided into three compartments.\n\nOn the left side of the tray, there are three fruits: two oranges and one apple or peach.\n\nOn the right side of the tray, there are granola and almonds. The granola occupies the upper right section, while the almonds are in the lower right section.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/021.png": "On the left side of the image, there are three pieces of fruit: two oranges and one nectarine. On the right side of the image, there are sections containing granola and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/022.png": "On the left side of the image, there are two tangerines (or small oranges) and a peach. On the right side of the image, there are granola (or oats) and almonds. The food items are placed in a compartmentalized tray.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/023.png": "On the left side of the image, there are three clementines and one peach or nectarine. On the right side of the image, there is a mixture of granola and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/024.png": "On the left side of the image, there are a peach and two mandarin oranges. On the right side of the image, there is a mix of granola and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/025.png": "On the left side of the image, there are three pieces of fruit: one nectarine and two mandarins. On the right side of the image, there is a pile of banana chips mixed with some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/026.png": "On the left side of the image, there are three fruits: two oranges and one peach. On the right side of the image, there is a compartment containing granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/027.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is a mix of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/028.png": "On the left side of the image, there are two oranges and one nectarine. On the right side of the image, there is a mixture of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/029.png": "In the image, the left side has one peach and two oranges. The right side contains granola with almonds and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/030.png": "The image shows a compartmentalized tray with different foods. On the left side of the image, there are three pieces of fruit: two tangerines and a peach. On the right side, the compartment contains granola, a mix of dried banana slices, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/031.png": "On the left side of the image, there are three fruits: one peach at the top and two tangerines below it. \n\nOn the right side, there is a portion of granola mixed with dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/032.png": "On the left side of the image, there are three citrus fruits (oranges/mandarins) and one peach or nectarine. \n\nOn the right side of the image, there is a mixture of granola, almonds, and sliced dried bananas.",
    "datasets/MVTec_Loco/breakfast_box/test/good/033.png": "The image shows a divided container with two sections:\n\n- **Left Side:** There are three pieces of fruit – two tangerines (or oranges) and one peach (or nectarine).\n- **Right Side:** There is a mix of granola, nuts (likely almonds), and dried banana chips.\n\nThe left side has fresh fruits, while the right side has a combination of granola and dried snacks.",
    "datasets/MVTec_Loco/breakfast_box/test/good/034.png": "On the left side of the image, there are two tangerines and one pear. On the right side of the image, there is a section filled with granola, which includes almonds and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/035.png": "On the left side of the image, there are three pieces of fruit: two oranges and one nectarine. On the right side of the image, there is a mixture of granola with oats, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/036.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach or nectarine. On the right side of the image, there is a mixture of granola, dried banana chips, and nuts (such as almonds).",
    "datasets/MVTec_Loco/breakfast_box/test/good/037.png": "On the left side of the image, there is a section with one peach and two tangerines. On the right side of the image, there is a mixture of granola, almonds, and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/038.png": "On the left side of the image, there are two tangerines and an apple. \n\nOn the right side of the image, there is a mixture of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/039.png": "On the left side of the image, there is one peach and two oranges or clementines. \n\nOn the right side of the image, there is a mixture of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/040.png": "On the left side of the image, there are two tangerines and one nectarine. On the right side, there is a section filled with granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/041.png": "On the left side of the image, there are two tangerines and a peach. On the right side of the image, there is a mixture of granola, almonds, and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/042.png": "In the image, the left side features three whole fruits, likely two oranges and a nectarine. The right side contains a mix of granola and dried banana chips with some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/043.png": "On the left side of the image, there are two oranges and one peach or nectarine. On the right side of the image, there is a mix of granola and dried banana chips along with some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/044.png": "In the image, on the left side, there are three whole fruits: two oranges and one nectarine. On the right side, there is a mix of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/045.png": "The left side of the image contains two oranges and a nectarine. The right side of the image contains granola and banana chips, along with what appear to be some nuts (such as almonds) mixed in with the granola.",
    "datasets/MVTec_Loco/breakfast_box/test/good/046.png": "On the left side of the image, there are three mandarins and a nectarine. On the right side of the image, there is a compartment containing granola and a mixture of almonds and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/047.png": "On the left side of the image, there are three fruits: two tangerines or oranges and one peach or nectarine. \n\nOn the right side of the image, there is a mixture of granola and dried banana chips with almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/048.png": "In the image, on the left side, there are two oranges and one peach. On the right side of the image, there is granola and a mixture of nuts and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/049.png": "On the left side of the image, there are two tangerines (or oranges) and one peach. \n\nOn the right side of the image, there is granola mixed with several banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/050.png": "On the left side of the image, there are three pieces of fruit: two tangerines and one nectarine or peach. On the right side of the image, there is a section filled with granola and dried banana chips, along with a few almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/051.png": "On the left side of the image, there are three fruits: a peach and two oranges. \n\nOn the right side of the image, there is a mix of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/052.png": "On the left side of the image, there are three whole fruits: it appears to be two tangerines and one peach. \n\nOn the right side of the image, there is a mix of granola, dried banana chips, and a few almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/053.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is granola, along with some dried banana slices and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/054.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there is granola with some banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/055.png": "The left side of the image contains two oranges and one red apple. The right side of the image contains granola and a mixture of dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/056.png": "In the image, the left side contains three whole fruits: two tangerines (or similar citrus fruits) and one nectarine (or similar stone fruit). The right side is divided into two sections: the upper section contains granola, and the lower section holds a mixture of banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/057.png": "The left side of the image contains three fruits: two oranges and one apple.\n\nThe right side of the image contains a portion of granola and a mix of banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/058.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is granola with almonds and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/059.png": "On the left side of the image, there are three whole fruits: two oranges and one apple or nectarine.\n\nOn the right side of the image, there is a mix of granola and dried banana chips, along with some nuts.",
    "datasets/MVTec_Loco/breakfast_box/test/good/060.png": "On the left side of the image, there are two tangerines (or small oranges) and a peach. On the right side of the image, there is a mixture of granola, nuts (such as almonds), and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/061.png": "On the left side of the image, there are two oranges and one peach. On the right side, there is a mixture of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/062.png": "The left side of the image contains three pieces of fruit: two oranges or tangerines and one peach or nectarine. The right side of the image contains a mix of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/063.png": "In the image, on the left side, there are three pieces of fruit: two oranges and one mango. On the right side, there is a mixture of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/064.png": "In the image, the left side of the tray contains three fruits: a nectarine at the top and two oranges below it. On the right side of the tray, there is a mixture of granola, almonds, and dried banana slices.",
    "datasets/MVTec_Loco/breakfast_box/test/good/065.png": "The left side of the image shows three pieces of fruit: two tangerines and a peach. The right side of the image contains granola with dried banana slices and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/066.png": "On the left side of the image, there are two clementines and one nectarine. On the right side of the image, there is a portion of granola and a mixture of banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/067.png": "The left side of the image contains a peach and two mandarins/tangerines. The right side of the image contains granola, sliced dried bananas, and some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/068.png": "The image depicts a food tray with two compartments. \n\nOn the left side of the tray, there are three pieces of fruit: two oranges and a peach.\n\nOn the right side of the tray, there is a mixture of granola, nuts (such as almonds), and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/069.png": "On the left side of the image, there are three pieces of fruit: two tangerines and one nectarine. On the right side of the image, there is a mix of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/070.png": "In the provided image, the left side contains three whole fruits, which appear to be two oranges and one nectarine. On the right side, there is a mixture of granola, almonds, and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/071.png": "On the left side of the image, there are three pieces of fruit: one peach at the top and two oranges below it.\n\nOn the right side of the image, there is a section filled with granola and a mixture of banana chips, nuts (such as almonds), and possibly other dried fruits.",
    "datasets/MVTec_Loco/breakfast_box/test/good/072.png": "On the left side of the image, there are three fruits: two oranges and one peach or nectarine. On the right side of the image, there is a combination of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/073.png": "On the left side of the image, there are three pieces of fruit: one peach (or nectarine) and two tangerines (or similar citrus fruits). On the right side of the image, there is a mixture of granola, including oats, banana chips, and whole almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/074.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there is granola along with some dried banana slices and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/075.png": "In the image, on the left side, there is one peach-like fruit and two oranges or tangerines. On the right side, there is granola along with dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/076.png": "On the left side of the image, there are two oranges and one nectarine in a compartment of a food tray. On the right side of the image, there is granola with pieces of banana chips and almonds in a larger compartment of the food tray.",
    "datasets/MVTec_Loco/breakfast_box/test/good/077.png": "On the left side of the image, there are three pieces of fruit: two oranges and an apple. On the right side of the image, there is granola along with dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/078.png": "On the left side of the image, there are three whole fruits which appear to be two oranges and one peach. On the right side of the image, there is a mixture of granola and dried banana chips with some almonds as well.",
    "datasets/MVTec_Loco/breakfast_box/test/good/079.png": "On the left side of the image, there are three fruits: two oranges at the top and one apple at the bottom. \n\nOn the right side of the image, there is a mixture of granola and dried banana chips with some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/080.png": "The image shows a divided container with different items on each side.\n\n- **Left Side:** The left side of the container holds three pieces of fruit – two oranges and a peach or similar stone fruit.\n- **Right Side:** The right side of the container contains a mix of granola, dried banana chips, and almonds.\n\nThe container is organized to separate the fresh fruit from the granola and dried fruits/nuts.",
    "datasets/MVTec_Loco/breakfast_box/test/good/081.png": "On the left side of the image, there are three fruits: two tangerines and one peach. On the right side of the image, there are granola and mixed nuts, including almonds and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/082.png": "The left side of the image contains a compartment with a peach and two tangerines. The right side of the image has a larger compartment that contains granola mixed with almonds and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/083.png": "On the left side of the image, there are three fruits: two oranges and one peach or nectarine.\n\nOn the right side of the image, there is a serving of granola and a mix of dried fruits and nuts.",
    "datasets/MVTec_Loco/breakfast_box/test/good/084.png": "The image depicts a divided food container with different items in each section:\n\n- On the left side, there are three pieces of fruit: two tangerines/mandarins (top) and one nectarine or peach (bottom).\n- On the right side, there is a section filled with granola, which appears to contain rolled oats, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/085.png": "The image shows a divided tray with food items. On the left side of the tray, there are three whole fruits: two oranges and one apple. On the right side of the tray, there is a portion of granola and a mix of banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/086.png": "The left side of the image contains three pieces of fruit: one peach and two tangerines (or similar citrus fruits). The right side of the image contains granola, with visible almonds and banana chips mixed in.",
    "datasets/MVTec_Loco/breakfast_box/test/good/087.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is granola with dried banana slices and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/088.png": "On the left side of the image, there are two tangerines and one nectarine. On the right side of the image, there is a portion of granola, some banana chips, and a few almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/089.png": "On the left side of the image, there are three pieces of fruit: one peach at the bottom and two mandarin oranges above it.\n\nOn the right side of the image, there is granola with sliced dried bananas and whole almonds mixed in.",
    "datasets/MVTec_Loco/breakfast_box/test/good/090.png": "In the image, the left side contains two oranges and one peach. The right side contains a mix of granola, nuts, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/091.png": "On the left side of the image, there are three fruits: two oranges and a nectarine. On the right side of the image, there is a granola mixture which includes oats, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/092.png": "In the image, the left side contains two oranges (or possibly clementines) and one apple. The right side contains granola mixed with what appears to be dried banana slices and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/093.png": "On the left side of the image, there are three clementines (or small oranges) and one peach. On the right side of the image, there is granola with dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/094.png": "On the left side of the image, there are three whole fruits: one peach (or nectarine) and two oranges (or tangerines). \n\nOn the right side of the image, there is a combination of granola, almonds, and dried banana slices separated into their own compartment.",
    "datasets/MVTec_Loco/breakfast_box/test/good/095.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there is granola mixed with banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/096.png": "On the left side of the image, there are three pieces of fruit: two tangerines or oranges and one peach or nectarine. On the right side of the image, there is a section of granola mixed with banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/097.png": "The image shows a divided food container with two sections.\n\n- On the left side, there are two small oranges (such as clementines or tangerines) and one stone fruit (likely a nectarine or peach).\n- On the right side, there is a mix of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/good/098.png": "On the left side of the image, there are three pieces of fruit consisting of two tangerines and a peach. On the right side, there is a mix of granola, almonds, and dried banana chips. The items are placed in a divided tray.",
    "datasets/MVTec_Loco/breakfast_box/test/good/099.png": "On the left side of the image, there are three oranges (or tangerines) and one peach (or nectarine). On the right side of the image, there is a mixture of granola, nuts (such as almonds), and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/100.png": "On the left side of the image, there are two oranges and a peach. On the right side of the image, there is a granola mixture that includes oats, almonds, and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/good/101.png": "On the left side of the image, there are three fruits: one peach and two oranges. On the right side of the image, there is a mix of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/026.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach. On the right side of the image, there is a mix of dried banana chips and almonds. The items are contained within a divided, white, disposable tray.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/027.png": "On the left side of the image, there are two oranges and a nectarine. On the right side of the image, there is a mixture of banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/028.png": "On the left side of the image, there are three pieces of fruit: two tangerines and one nectarine. On the right side of the image, there is a pile of mixed nuts and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/029.png": "On the left side of the image, there are three pieces of fruit: one peach (or nectarine) and two tangerines (or other similar citrus fruits). On the right side of the image, there is a mixture of dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/030.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is a mixture of banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/031.png": "On the left side of the image, there are two tangerines and a peach (or nectarine). On the right side of the image, there is a mixture of dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/032.png": "The left side of the image contains three fresh fruits: two tangerines or mandarins and one nectarine or peach. The right side of the image contains a mix of dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/033.png": "On the left side of the image, there are three pieces of fruit: one peach at the top and two tangerines below it. The fruits are placed in the left compartment of a divided food container. On the right side of the image, there is an empty larger compartment of the same food container.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/034.png": "On the left side of the image, there are three fruits: two oranges and one peach. The right side of the image is empty. The fruits are placed in the compartment of a divided container.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/035.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach. On the right side of the image, there is an empty compartment of a divided tray or container.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/036.png": "On the left side of the image, there is a section of a meal tray containing one apple and two mandarin oranges. On the right side of the image, there is an empty section of the meal tray.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/037.png": "On the left side of the image, there are two oranges and one peach or nectarine. On the right side of the image, there is a portion of granola or some type of oat cereal.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/038.png": "On the left side of the image, there are three pieces of fruit: two small oranges (or tangerines) and a peach. On the right side of the image, there is a serving of granola. These items are placed in a divided food container.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/039.png": "On the left side of the image, there are three fruits: one peach and two mandarins. On the right side of the image, there is a portion of granola.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/040.png": "In the image, the left side contains one peach and two citrus fruits (such as tangerines or clementines). The right side is filled with granola.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/041.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach. On the right side of the image, there is a section filled with granola.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/042.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach or nectarine. On the right side of the image, there is a portion of granola or a similar type of oat-based cereal.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/043.png": "In the image, on the left side, there are three fruits (two oranges and one apple). On the right side, there is a portion of granola.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/044.png": "On the left side of the image, there are three whole fruits: two tangerines and one nectarine. \n\nOn the right side of the image, there is a mix of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/045.png": "The left side of the image contains three pieces of fruit (possibly oranges or nectarines) and some almonds. The right side of the image contains granola, dried banana chips, and more almonds. The image shows a divided container with these food items separated into different sections.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/046.png": "On the left side of the image, there are two tangerines and a peach. On the right side of the image, there are granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/047.png": "On the left side of the image, there are three pieces of fruit: two clementines and one nectarine. On the right side of the image, there is a mixture of granola, sliced dried bananas, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/048.png": "On the left side of the image, there are two clementines and one nectarine or peach. \n\nOn the right side of the image, there is a portion of granola at the top and a mix of dried banana slices and almonds towards the bottom.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/049.png": "On the left side of the image, there are three whole fruits: a peach and two clementines (or similar citrus fruits). \n\nOn the right side of the image, there is a mix of granola and dried banana chips with some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/050.png": "The image shows a food tray partitioned into two sections:\n\n- **Left Side:** Contains three pieces of fruit (two oranges and one nectarine).\n- **Right Side:** Contains a serving of granola, along with some banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/051.png": "The left side of the image contains three pieces of fruit: two tangerines and one apple. The right side of the image has granola, mixed with dried bananas and some nuts (such as almonds).",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/052.png": "The left side of the image contains three peaches. The right side of the image has a mixture of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/053.png": "On the left side of the image, there are three whole peaches. \n\nOn the right side of the image, there is a mixture of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/054.png": "On the left side of the image, there are two nectarines and one tangerine. On the right side of the image, there is a mixture of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/055.png": "On the left side of the image, there are three mandarins or tangerines. On the right side of the image, there is a mixture of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/056.png": "On the left side of the image, there are three whole fruits: one orange and two peaches or nectarines. On the right side of the image, there is a combination of granola and dried banana chips with some whole almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/057.png": "On the left side of the image, there are three pieces of fruit: two apples and one orange. \n\nOn the right side of the image, there is granola, along with a mixture of nuts (including almonds) and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/058.png": "On the left side of the image, there is an orange. On the right side of the image, there is a mixture of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/059.png": "On the left side of the image, there are two oranges. On the right side of the image, there is a mix of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/060.png": "In the image, the left side shows two oranges, while the right side is divided into two sections: one containing granola and the other containing banana chips and some nuts.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/061.png": "On the left side of the image, there is a mandarin orange. On the right side of the image, there are granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/062.png": "The image shows a divided tray with two sections:\n\n- On the left side of the tray, there is an orange and a peach.\n- On the right side of the tray, there is a mixture of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/063.png": "On the left side of the image are three peaches. On the right side of the image, there is granola at the top and banana chips with some almonds towards the bottom.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/064.png": "On the left side of the image, there are three clementine or tangerine oranges. On the right side of the image, there are granola and dried banana slices with some nuts mixed in.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/065.png": "On the left side of the image, the compartment is empty. On the right side of the image, there is a mixture of granola, dried banana chips, almonds, and other nuts.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/066.png": "On the left side of the image, there are three whole oranges. \n\nOn the right side of the image, there is a mix of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/067.png": "In the image, the right side of the container is filled with granola and dried banana chips mixed with some almonds. The left side of the container is empty.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/068.png": "On the left side of the image, there are four orange tangerines or clementines. On the right side of the image, there is a section containing granola, dried banana chips, and almonds. The items are placed in a divided tray.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/069.png": "In the image, the left side contains an apple and an orange. The right side contains granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/070.png": "On the left side of the image, there are four whole oranges (or possibly tangerines). On the right side of the image, there is a mix that looks like granola with oats, nuts (such as almonds), and dried banana slices. The food items are placed in a divided tray.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/071.png": "In the image, the left side contains three whole fruits: two mandarins and one peach (or nectarine). The right side contains a mixture of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/072.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is a compartment filled with granola.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/073.png": "On the left side of the image, there are three fruits: two mandarins and one peach. On the right side of the image, there is a serving of granola with some nuts and dried banana chips.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/074.png": "On the left side of the image, there are two tangerines (or clementines) and a peach (or nectarine). On the right side of the image, there is a mix of granola, dried banana chips, and some almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/075.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach. On the right side of the image, there is a large portion of granola or oats.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/076.png": "In the image, the left side contains three fruits, specifically two oranges and one peach. The right side contains a portion of granola with some dried banana slices and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/077.png": "The left side of the image shows three whole fruits: a peach and two oranges. The right side of the image contains a serving of granola along with some dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/078.png": "On the left side of the image, there are three pieces of fruit: one nectarine and two mandarins. On the right side of the image, there is a mixture of banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/079.png": "On the left side of the image, there are three whole fruits, specifically two tangerines and a peach. On the right side of the image, there is a mixture of dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/080.png": "On the left side of the image, there are three whole fruits: two oranges and one nectar. \n\nOn the right side of the image, there is a mixture consisting of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/081.png": "On the left side of the image, there are three fruits: two tangerines and one nectarine. On the right side of the image, there is a portion of granola.",
    "datasets/MVTec_Loco/breakfast_box/test/logical_anomalies/082.png": "On the left side of the image, there are two tangerines and one nectarine (or peach). On the right side, there is a mixture of dried banana chips and almonds.",
    "datasets/MVTec_Loco/breakfast_box/train/good/042.png": "On the left side of the image, there is one apple(can also be nectarine, peach) and two mandarins (can also be oranges or tangerines, clementines). On the right side of the image, there is granola, banana chips (or dried banana chip), and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/003.png": "In the provided image:\n\n- On the left side, there are two oranges and one peach.\n- On the right side, there is a section with granola and some dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/005.png": "On the left side of the image, there are two tangerines and an apple. On the right side, there is granola mixed with dried banana chips and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/009.png": "On the left side of the image, there are three fruits: one peach (at the top) and two oranges (below the peach). On the right side of the image, there is granola with dried banana chips and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/010.png": "On the left side of the image, there are two oranges and an apple. On the right side, there is a section with granola and dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/011.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach. On the right side of the image, there is granola mixed with dried banana chips and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/014.png": "On the left side of the image, there are two tangerines and one apple. \n\nOn the right side of the image, there are granola and banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/016.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is a mix of granola and dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/017.png": "On the left side of the image, there are three whole fruits, two of which appear to be oranges or tangerines, and one looks like an apple. \n\nOn the right side of the image, there is a section containing granola, dried banana slices, and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/019.png": "On the left side of the image, there are three fruits: two oranges and an apple. On the right side of the image, there are granola and a mix of dried fruits and nuts, including banana chips and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/020.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is granola, almonds, and what appears to be dried banana slices.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/021.png": "The left side of the image shows two tangerines and a peach. The right side of the image contains granola and a mixture of nuts and dried fruits.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/023.png": "On the left side of the image, there are three fruits: two tangerines and one peach or nectarine. On the right side of the image, there is a mixture of granola, dried banana slices, and some nuts.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/025.png": "In the image, the left side contains two oranges and an apple. The right side has granola, dried banana chips, and some nuts.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/000.png": "In the image, on the left side, there is a section containing granola, banana slices, and almonds. On the right side, there are three oranges.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/002.png": "In the image, on the left side, there is a section containing granola and banana chips. On the right side, there are two tangerines and one nectarine.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/004.png": "On the left side of the image, there are two oranges and a nectarine. On the right side, there are clusters of granola at the top and banana chips at the bottom.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/007.png": "On the left side of the image, there are three fruits: two tangerines and one apple. On the right side, there is a section containing granola and dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/008.png": "On the left side of the image, there is one peach and two tangerines. On the right side of the image, there is granola and banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/012.png": "On the left side of the image, there are two tangerines and a nectarine. On the right side of the image, there is granola and dried banana slices.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/013.png": "On the left side of the image are three whole fruits, specifically one apple and two mandarin oranges or clementines. On the right side of the image are granola and a portion of banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/016.png": "On the left side of the image, there are three oranges and one peach. On the right side of the image, there is granola and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/018.png": "On the left side of the image, there are three pieces of fruit: two oranges and one nectarine. On the right side of the image, there is a mix of granola and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/020.png": "On the left side of the image, there are three pieces of fruit: one that looks like a peach or apple, and two that seem to be mandarins or small oranges. On the right side of the image, there is a mixture of granola and whole almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/021.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach or nectarine. On the right side of the image, there are granola and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/023.png": "On the left side of the image, there are three oranges and one nectarine or peach. On the right side, there is a mixture consisting of granola and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/024.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there is granola and a mixture of almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/000.png": "In the image, the left side contains three fruits: two oranges and one apple. The right side includes granola or some type of cereal, along with a mix of almonds and banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/001.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach or nectarine. On the right side of the image, there is granola and a mix of dried fruits and nuts.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/002.png": "In the image, on the left side, there are three whole fruits: two oranges and one nectarine or peach. On the right side, there is a mix of granola with nuts and dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/004.png": "On the left side of the image, there are two tangerines and what appears to be a nectarine.\n\nOn the right side of the image, there is a section filled with granola and dried banana slices.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/006.png": "On the left side of the image, there are two tangerines and a peach. On the right side of the image, there is granola and a mix of dried banana slices and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/007.png": "On the left side of the image, there are three pieces of fruit: one apple and two mandarin oranges.\n\nOn the right side of the image, there is a mixture of granola, dried banana chips, and some whole almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/008.png": "On the left side of the image, there are two tangerines and one peach. On the right side of the image, there is granola, along with a mixture of sliced dried bananas and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/012.png": "On the left side of the image, there are two tangerines and one apple. On the right side, there is a section filled with granola and dried banana slices.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/013.png": "On the left side of the image, there are three fruits: two oranges (or tangerines) and one nectarine. On the right side of the image, there is a portion of granola and a mix of dried banana slices and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/015.png": "On the left side of the image, there are two oranges/tangerines and one red apple. On the right side of the image, there is a mixture of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/018.png": "In the image, the left side of the container holds a peach and two tangerines. The right side of the container is divided into two sections: the larger section has granola, and the smaller section contains dried banana chips and various nuts.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/022.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach or nectarine. On the right side of the image, there is a compartment containing granola and a mix of dried bananas and nuts, likely almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/good/024.png": "On the left side of the image, there are two apples and two oranges. On the right side of the image, there are granola, dried banana slices, and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/001.png": "On the left side of the image, there is a compartment containing granola with dried banana chips and almonds. On the right side of the image, there is another compartment containing two oranges and one nectarine.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/003.png": "On the left side of the image, there are three pieces of fruit: two oranges (or tangerines) on the top and middle, and a nectarine or plum on the bottom. On the right side of the image, there is a section filled with granola and dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/005.png": "On the left side of the image, there are three fruits: two oranges and one peach. \n\nOn the right side of the image, there are granola and banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/006.png": "On the left side of the image, there are three fruits: two oranges and one peach or nectarine. On the right side of the image, there is a mix of granola and dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/009.png": "On the left side of the image, there are three fruits: one peach and two tangerines (or similar small oranges). On the right side of the image, there is a combination of granola and sliced dried bananas.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/010.png": "On the left side of the image, there are four pieces of fruit: three oranges and one peach/nectarine. On the right side of the image, there is granola and dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/011.png": "In the image, on the left side, there are three fruits: two oranges and one peach. On the right side, there are granola and dried banana chips.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/014.png": "On the left side of the image, there are fruits - specifically, one peach and two tangerines. \n\nOn the right side of the image, there are granola clusters and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/015.png": "On the left side of the image, there are three pieces of fruit: two oranges and one nectarine or peach. On the right side of the image, there is a section containing granola and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/017.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is a mix of granola and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/019.png": "The left side of the image contains two oranges and one apple. The right side of the image contains granola and almonds.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/022.png": "On the left side of the image, there are three oranges and one nectarine. On the right side of the image, there is granola at the top and almonds at the bottom.",
    "datasets/MVTec_Loco/mini/breakfast_box/test/logical_anomalies/025.png": "On the left side of the image, there are two oranges and one peach (or nectarine). On the right side of the image, there are banana chips mixed with almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/003.png": "On the left side of the image, there are three whole fruits: two oranges and one peach. On the right side of the image, there is a mixture that appears to be granola on the upper half and dried banana chips mixed with some nuts on the lower half.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/004.png": "On the left side of the image, there are two clementines and one nectarine.\n\nOn the right side of the image, there is a section with granola, which appears to include oats, banana chips, and some almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/005.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there are granola, dried banana chips, and a few almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/008.png": "In the left side of the image, there are two whole tangerines and one whole peach or nectarine. \n\nOn the right side of the image, there are granola, banana chips, and whole almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/010.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is a section filled with granola, and below it is a mix of dried banana chips and nuts (mainly almonds).",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/011.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach or nectarine. On the right side of the image, there is a mix of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/014.png": "On the left side of the image, there are two mandarins and one red apple. On the right side of the image, there is granola along with dried banana chips and some almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/018.png": "On the left side of the image, there are three fruits: two oranges (or tangerines) and one apple (or nectarine). \n\nOn the right side of the image, there is granola or oat clusters, along with a mixed assortment that includes banana chips and nuts (such as almonds).",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/020.png": "On the left side of the image, there are two oranges and a peach or nectarine. On the right side of the image, there is a portion of granola, along with mixed nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/021.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there is granola on the upper portion and a mix of nuts and dried banana chips on the lower portion.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/022.png": "On the left side of the image, there are three oranges and one peach or nectarine. On the right side of the image, there is granola and a mixture of nuts and dried fruits, including almonds and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/023.png": "On the left side of the image, there are two tangerines and a peach. On the right side of the image, there is granola, which appears to be mixed with dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/024.png": "In the image, the left side contains two clementines and one apple. On the right side, there is a section filled with granola and dried banana chips mixed with almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/028.png": "The left side of the image contains a nectarine and two tangerines. The right side of the image contains granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/029.png": "On the left side of the image, there is one apple and two oranges. On the right side of the image, there is granola and a mix of nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/030.png": "On the left side of the image, there are two tangerines (or small oranges) and a peach. On the right side of the image, there is granola, with a mixture of nuts (such as almonds) and dried banana slices (banana chips).",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/031.png": "On the left side of the image, there are two tangerines and a peach. On the right side of the image, there is a mixture of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/032.png": "In the image, the left side contains two small oranges and a nectarine. The right side contains granola, along with some dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/033.png": "On the left side of the image, there are two tangerines and one apple. \n\nOn the right side of the image, there is a serving of granola and a mix of dried banana chips and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/040.png": "The left side of the image contains three pieces of fruit: two tangerines and one nectarine. The right side of the image contains granola mix with nuts and dried banana slices.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/041.png": "On the left side of the image, there are two oranges and one apple. On the right side, there is a section containing granola mixed with dried banana slices and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/042.png": "On the left side of the image, there are three whole fruits: two tangerines and one nectarine or peach.\n\nOn the right side of the image, there is a mixture of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/043.png": "On the left side of the image, there are two oranges and one nectarine. On the right side of the image, there is a section filled with granola and a mixture of dried banana chips and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/045.png": "In the provided image, on the left side, there are two oranges and one peach. On the right side, there is a portion of granola and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/046.png": "On the left side of the image, there are two tangerines and one peach. On the right side of the image, there is granola in the top section and a mix of almonds and dried banana chips in the bottom section.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/047.png": "In the image:\n\n- On the left side, there are two oranges and one nectarine or peach.\n- On the right side, there is a portion of granola and a mix of dried fruits that appear to include banana chips and possibly nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/050.png": "On the left side of the image, there are three pieces of fruit: two oranges and one apple (or possibly a peach or nectarine). On the right side of the image, there is a section filled with granola and dried banana chips, along with a few nuts (likely almonds).",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/052.png": "On the left side of the image, there are three fruits, specifically two oranges and one nectarine. \n\nOn the right side of the image, there is a mixture of granola, banana chips, and some whole almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/056.png": "On the left side of the image, there are three whole fruits: two small oranges (possibly clementines) and one nectarine. \n\nOn the right side of the image, there is a section divided into two parts: one larger part containing granola and one smaller part containing a mixture of banana chips and nuts (almonds).",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/058.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is granola, mixed nuts (including almonds), and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/061.png": "On the left side of the image, there are three pieces of fruit. Specifically, there are two tangerines/oranges and one peach/nectarine.\n\nOn the right side of the image, there is a compartment containing granola, sliced dried bananas, whole almonds, and possibly other nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/064.png": "On the left side of the image, there are three whole fruits: two oranges (or tangerines) and one nectarine (or peach).\n\nOn the right side of the image, there is a mix of granola, and a combination of nuts (such as almonds) and dried banana slices.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/066.png": "On the left side of the image, there are three tangerines (or clementines) and one apple. \n\nOn the right side of the image, there is a section filled with granola, as well as a mix of banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/075.png": "In the left compartment of the container, there are two tangerines and a peach. In the right compartment of the container, there is granola mixed with dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/077.png": "On the left side of the image, there are two tangerines and an apple. On the right side of the image, there is a mixture of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/079.png": "On the left side of the image, there are two oranges (or clementines) and one apple. On the right side of the image, there is granola (or a similar type of cereal) and a mixture of dried banana chips and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/081.png": "On the left side of the image, there are three pieces of fruit that appear to be two tangerines and one apple or nectarine. \n\nOn the right side of the image, there is a section containing granola, along with a mix of nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/082.png": "On the left side of the image, there are two tangerines (or similar citrus fruits) and one peach (or similar stone fruit). On the right side of the image, there is granola, which includes oats and a mix of nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/083.png": "On the left side of the image, there are two tangerines (or oranges) and a peach or nectarine. On the right side of the image, there is a portion of granola or oats accompanied by a mixture of dried bananas and various nuts (such as almonds and walnuts).",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/084.png": "On the left side of the image, there are two tangerines and a nectarine or peach. On the right side of the image, there is a partitioned section containing granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/086.png": "On the left side of the image, there are two tangerines (or similar citrus fruits) and a peach. On the right side of the image, there are granola, nuts (such as almonds), and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/087.png": "The left side of the image has two tangerines and an apple. The right side of the image contains granola and a mix of dried banana slices and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/089.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is a section of granola, mixed with dried banana slices and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/090.png": "In the image, the left side contains two oranges and one peach. The right side contains granola, along with a mix of nuts and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/093.png": "On the left side of the image, there are three pieces of fruit: two mandarins and what appears to be a peach or nectarine.\n\nOn the right side of the image, there is a compartment filled with granola, which includes oats, almonds, and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/094.png": "On the left side of the image, there are two tangerines and one apple. \n\nOn the right side of the image, there is granola, almonds, and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/095.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is a mixture of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/096.png": "In the image:\n\n- The left side contains two tangerines and a peach.\n- The right side contains granola, almonds, and slices of dried banana.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/097.png": "The left side of the image contains two tangerines and one nectarine. The right side of the image features granola accompanied by a mix of banana chips and various nuts such as almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/099.png": "On the left side of the image, there are three pieces of fruit: one apple and two oranges. \n\nOn the right side of the image, there is a mixture of granola, nuts, and dried banana slices.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/100.png": "In the image, the left side contains two small oranges (which appear to be tangerines or clementines) and a nectarine (or a peach). The right side contains granola along with a mix of dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/001.png": "On the left side of the image, there is a portion of granola mixed with banana chips and almonds. On the right side of the image, there are two oranges and one nectarine or peach.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/004.png": "In the image:\n\n- On the left side: There are three pieces of fruit, specifically two tangerines and one nectarine.\n- On the right side: There are granola and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/007.png": "On the left side of the image, there are three pieces of fruit: two small oranges (or tangerines) and one apple. On the right side of the image, there are sections of granola and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/009.png": "On the left side of the image, there are three fruits: two tangerines (or clementines) and one peach (or nectarine). \n\nOn the right side of the image, there is a section containing granola and a small amount of dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/010.png": "On the left side of the image, there are three pieces of fruit: two oranges and what appears to be a nectarine or peach. On the right side of the image, there are granola and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/011.png": "On the left side of the image, there are two oranges and a peach placed in a compartment. \n\nOn the right side of the image, there are three separate components:\n1. At the top, there is a large portion of granola.\n2. At the bottom, there is a portion of banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/012.png": "On the left side of the image, there are two tangerines and one nectarine. On the right side of the image, there is granola in the top section and dried banana chips in the bottom section.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/013.png": "On the left side of the image, there are three whole fruits that appear to be tangerines or clementines. \n\nOn the right side of the image, there is a section divided into two parts. The upper part contains granola, and the lower part contains banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/015.png": "On the left side of the image, there are two oranges (or tangerines) and a peach (or nectarine). On the right side of the image, there are granola and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/017.png": "On the left side of the image, there are two oranges and an apple. On the right side of the image, there is a section of granola and a section of almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/024.png": "On the left side of the image, there are two tangerines and one peach. On the right side of the image, there are granola and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/025.png": "On the left side of the image, there are two tangerines and one nectarine. On the right side of the image, there are banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/027.png": "On the left side of the image, there are three fruits: two tangerines and one peach. On the right side of the image, there is a mix of dried banana slices and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/029.png": "On the left side of the image, there are two tangerines and one peach or nectarine. On the right side of the image, there are dried banana chips mixed with some nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/031.png": "In the image:\n\n- On the left side, there are two tangerines (or small oranges) and one nectarine.\n- On the right side, there is a mix of dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/033.png": "On the left side of the image, there are two oranges and one peach placed in a compartment of a food container. On the right side of the image, there is an empty compartment of the same food container.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/035.png": "On the left side of the image, there are three oranges. On the right side of the image, there is an empty compartment of the tray.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/036.png": "On the left side of the image, there are three pieces of fruit: one apple and two oranges. The right side of the image is empty, containing no items.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/038.png": "On the left side of the image, there are three round fruits: two oranges (or tangerines) and a peach. On the right side of the image, there is a pile of granola or rolled oats.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/040.png": "On the left side of the image, there is one nectarine and two mandarin oranges. On the right side of the image, there is a serving of granola.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/041.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there is a serving of granola.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/042.png": "On the left side of the image, there are three whole fruits: two oranges and one nectarine. On the right side of the image, there is a portion of granola or a similar type of cereal.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/044.png": "In the image, the left side contains three pieces of fruit (two oranges and a peach). The right side contains a mix of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/045.png": "On the left side of the image, there are three small oranges (or tangerines) and a nectarine, with some almonds scattered around. On the right side of the image, there is a section containing granola, more almonds, and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/046.png": "On the left side of the image, there are two tangerines and a peach. \n\nOn the right side of the image, there is granola in one section and a mix of almonds and banana chips in another section.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/048.png": "On the left side of the image, there are two oranges and a peach. On the right side of the image, there is granola along with some mixed nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/049.png": "The left side of the image contains two oranges and one peach. The right side of the image contains granola and what appears to be dried banana chips and some nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/051.png": "In the left section of the image, there are two oranges and one peach. In the right section of the image, there is a portion of granola with banana chips, almonds, and possibly some other nuts and dried fruits.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/053.png": "On the left side of the image, there are three peaches. \n\nOn the right side of the image, there are granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/054.png": "On the left side of the image, there are three pieces of fresh fruit: one orange and two nectarines. On the right side of the image, there are granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/057.png": "In the image:\n\n- On the left side, there are two apples and one tangerine.\n- On the right side, there are granola and a mix of nuts and dried banana chips.\n\nThe items are contained within a partitioned tray.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/060.png": "On the left side of the image, there are two oranges. On the right side of the image, there is a section with granola at the top and dried banana chips mixed with some other nuts or dried fruits at the bottom.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/063.png": "On the left side of the image, there are three whole peaches. On the right side of the image, there is a mixture of granola, dried banana chips, and some other dried fruits and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/064.png": "On the left side of the image, there are three tangerines (or similar citrus fruits). On the right side of the image, there is a mixture of granola and dried banana slices.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/066.png": "On the left side of the image, there are three oranges (or tangerines). On the right side of the image, there is a mixture that appears to include granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/067.png": "In the image, the left side of the container is empty. The right side of the container is filled with granola, sliced dried bananas, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/072.png": "On the left side of the image, there are two small oranges (likely tangerines or clementines) and one apple. On the right side of the image, there is a large portion of granola.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/074.png": "On the left side of the image, there are two tangerines and a nectarine. On the right side of the image, there are granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/075.png": "On the left side of the image, there are three pieces of fruit: two oranges and a peach. On the right side of the image, there is a section filled with granola or a similar type of cereal.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/076.png": "On the left side of the image, there are two tangerines and one nectarine. On the right side of the image, there is a portion of granola with some dried fruit and nuts mixed in.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/077.png": "The left side of the image contains two oranges and one red apple. The right side of the image has granola accompanied by some dried banana slices and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/000.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is a section of granola and a mixture of nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/001.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there are granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/002.png": "On the left side of the image, there are three pieces of fruit: two oranges and one peach or nectarine. On the right side of the image, there are granola, nuts, and dried fruit pieces, including banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/006.png": "In the image, the left side contains two oranges and a peach. The right side of the image has some granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/007.png": "On the left side of the image, there are three pieces of fruit: one peach and two mandarins. On the right side of the image, there are granola, dried banana chips, and a few almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/009.png": "On the left side of the image, there are three pieces of fruit: one nectarine and two clementines (or small oranges). On the right side of the image, there is granola mixed with dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/012.png": "On the left side of the image, there are two tangerines and a nectarine. On the right side of the image, there is granola with dried banana slices, almonds, and other mixed nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/013.png": "In the image, the left side contains three tangerines or small oranges and one nectarine or peach. The right side contains granola, which includes oats, and what appears to be a mix of dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/015.png": "On the left side of the image, there are two oranges and one apple. On the right side of the image, there is a section containing granola, dried banana slices, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/016.png": "On the left side of the image, there are two tangerines and a peach. On the right side of the image, there is granola and a mix of dried banana slices and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/017.png": "On the left side of the image, there are three oranges and an apple. On the right side of the image, there is a portion of granola, along with a mixture of banana chips, almonds, and possibly other dried fruits or nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/019.png": "On the left side of the image, there are two tangerines and an apple. On the right side of the image, there is a section of granola accompanied by a mixture of dried banana chips and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/025.png": "On the left side of the image, there are two tangerines and one apple. \n\nOn the right side of the image, there is a mixture of granola, almonds, banana chips, and other nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/026.png": "The left side of the image features two oranges and one peach. The right side of the image is divided into two sections: the top section contains granola, and the bottom section contains a mixture of dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/027.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is granola, some banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/034.png": "On the left side of the image, there are two oranges and one pear. On the right side of the image, there is a section filled with granola, mixed nuts, and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/035.png": "In the image, the left side contains three pieces of fruit: two mandarins (or clementines) and one nectarine. On the right side of the image, there is a mixture of granola, which includes oats, nuts (such as almonds), and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/036.png": "On the left side of the image, there are three pieces of fruit: two mandarins (or similar citrus fruit) and one peach or nectarine. \n\nOn the right side of the image, there is a combination of granola, dried banana chips, and some nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/037.png": "On the left side of the image, there are three pieces of fruit: one peach and two clementines. \n\nOn the right side of the image, there is a mixture of granola, dried banana chips, and whole almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/038.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is a mixture of granola, nuts, and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/039.png": "On the left side of the image, there are two tangerines and one nectarine. On the right side of the image, there is a mixture of granola, almonds, and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/044.png": "On the left side of the image, there are two tangerines and one nectarine. On the right side of the image, there is a serving of granola mixed with dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/048.png": "In the image, on the left side, there are three whole fruits (two oranges and one other fruit that appears to be an apple or peach). On the right side, there is a section containing granola and some dried fruit and nuts (including dried banana slices and almonds).",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/049.png": "In the image:\n\n- On the left side, there are two oranges and a peach.\n- On the right side, there is a section containing granola (or oatmeal), dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/train/good/000.png": "On the left side of the image, there is one apple (can also be nectarine or peach) and two mandarins (can also be oranges or tangerines, clementines). On the right side of the image, there is granola, banana chips (or dried banana chip), and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/051.png": "On the left side of the image, there are three pieces of fruit: two oranges (or tangerines) and one peach.\n\nOn the right side of the image, there is granola and a mix of dried fruits and nuts, including slices of dried bananas and whole almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/053.png": "On the left side of the image, there are three pieces of fruit: two mandarins (or tangerines) and one red apple. On the right side of the image, there is a mixture of granola, nuts (such as almonds), and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/054.png": "On the left side of the image, there are two oranges and a peach. On the right side of the image, there is a mixture of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/055.png": "In the image, on the left side, there are three fresh fruits: two tangerines and one nectarine. On the right side, there is a mixture of granola and dried fruits including banana chips and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/057.png": "On the left side of the image, there are two oranges and an apple. On the right side of the image, there is granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/059.png": "On the left side of the image, there are two oranges and one apple. \n\nOn the right side of the image, there is a portion of granola mixed with dried banana chips and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/060.png": "On the left side of the image, there are two tangerines and one nectarine. On the right side of the image, there is granola and a mix of almonds and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/062.png": "The left side of the image contains three pieces of fruit: two oranges and one nectarine. The right side of the image consists of a mix of granola, dried banana chips, and some nuts like almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/063.png": "In the image, the left side contains three fruits: two clementines (or small oranges) and one larger fruit that appears to be a nectarine or apple. \n\nOn the right side, there is a mix of granola or oats, dried banana chips, and a few almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/065.png": "The left side of the image contains three fruits: two oranges and one peach. The right side of the image contains granola, along with a trail mix that includes banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/067.png": "On the left side of the image, there are two small oranges (likely tangerines) and one peach. On the right side of the image, there is a combination of granola, banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/068.png": "The left side of the image contains three pieces of fruit: two oranges and what appears to be a nectarine or peach. The right side of the image contains a mixture of granola, nuts (including almonds), and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/069.png": "On the left side of the image, there are two oranges and one peach or nectarine. On the right side of the image, there is a mix of granola and dried fruits and nuts, including banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/070.png": "In the image, the left side contains two mandarin oranges and a nectarine. The right side contains granola and a mixture of nuts and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/071.png": "On the left side of the image, there are two tangerines and one peach. On the right side of the image, there is a mix of granola and dried fruits as well as nuts, including banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/072.png": "On the left side of the image, there are three pieces of fruit: two small oranges (likely clementines) and one peach or nectarine. \n\nOn the right side of the image, there is a mix of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/073.png": "On the left side of the image, there are two mandarin oranges and one apple. \n\nOn the right side of the image, there is a combination of granola (or rolled oats) and a mix of banana chips, almonds, and possibly some other dried fruits or nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/074.png": "On the left side of the image, there are two tangerines (or oranges) and one peach (or nectarine). On the right side of the image, there is a mixture of granola, dried banana chips, and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/076.png": "On the left side of the image, there are three pieces of fruit: two tangerines and a nectarine. On the right side of the image, there is granola and a portion of banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/078.png": "On the left side of the image, there are three fruits that appear to be oranges or tangerines. On the right side of the image, there is a mixture of granola with nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/080.png": "In the image, the left side contains two oranges and one apple. The right side contains granola, mixed with banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/085.png": "On the left side of the image, there are three pieces of fruit: two oranges (or tangerines) and one apple. On the right side of the image, there is a granola mix that includes oats and dried banana chips, along with some nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/088.png": "On the left side of the image, there are two small oranges and one peach or nectarine. On the right side of the image, there is granola with dried banana chips and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/091.png": "In the image, the left side contains three oranges and one nectarine. The right side contains a section of granola with dried banana chips and nuts.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/092.png": "On the left side of the image, there are three fruits: two oranges and one apple. On the right side of the image, there is a portion of granola and a mixture of nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/098.png": "In the left side of the image, there are two oranges and one peach. On the right side of the image, there is a mix of granola, nuts (such as almonds), and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/good/101.png": "On the left side of the image, there is an apple and two mandarins. On the right side of the image, there is a portion of granola, along with a mix of nuts and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/000.png": "On the left side of the image, there is a mixture of granola, almond nuts, and dried banana chips. On the right side of the image, there are three whole tangerines or clementines.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/002.png": "On the left side of the image, there is a compartment containing granola with banana chips and some almonds. On the right side of the image, there is a compartment containing two tangerines and one apple.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/003.png": "On the left side of the image, there are three whole fruits: two tangerines and what appears to be a peach or nectarine. \n\nOn the right side of the image, there is a mixture of granola and dried banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/005.png": "On the left side of the image, there are three whole fruits: two small oranges and one small apple. On the right side of the image, there are granola and banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/006.png": "On the left side of the image, there are three pieces of fruit: two small oranges (such as clementines or tangerines) and one peach or nectarine.\n\nOn the right side of the image, there are two sections. The top section contains granola, and the bottom section contains banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/008.png": "In the image, the left side contains two small oranges and a peach. The right side contains granola and a portion of banana chips.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/014.png": "On the left side of the image, there are three whole fruits: two oranges and what appears to be a nectarine. \n\nOn the right side of the image, there is a portion of granola or muesli and a pile of almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/016.png": "On the left side of the image, there are three tangerines and one peach. On the right side of the image, there are granola and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/018.png": "On the left side of the image, there are three pieces of fruit, which appear to be mandarins and a peach or nectarine. On the right side of the image, there are clusters of granola at the top and a pile of almonds at the bottom.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/019.png": "On the left side of the image, there are three tangerines and a peach. On the right side of the image, there are granola and almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/020.png": "On the left side of the image, there are two tangerines and one apple. On the right side of the image, there is a section containing granola and unsalted almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/021.png": "On the left side of the image, there are two oranges or tangerines and a peach or nectarine. On the right side of the image, there is granola and a section containing almonds.",
    "datasets/MVTec_Loco/original/breakfast_box/test/logical_anomalies/022.png": "On the left side of the image, there are two oranges and one peach. On the right side of the image, there is a section with granola and another section containing almonds."
}