{"datasets/MVTec_Loco/original/splicing_connectors/train/good/018.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/000.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/001.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/002.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/003.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the top middle of the image. patch descriptions: The image contains a single yellow cable with a connector. The vertical position of the cable is in the middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/004.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/005.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/006.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the bottom middle of the image. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is in the top middle of the image. The connectors are not the same size; one is larger and the other is smaller.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/007.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is at the bottom. The connectors are not the same size; one is larger and the other is smaller.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/008.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/009.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are three connectors visible. There are two cables, one on top and one on the bottom. The cable on top is in the middle position, and the cable on the bottom is in the bottom position. The connectors are of the same size. The cables appear to be intact and not broken. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/010.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/011.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/012.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/013.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/014.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/015.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/016.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the top middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/017.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is at the bottom.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/018.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/019.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/020.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/021.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/022.png": "The image contains a single connector. The cable is in the vertical position, which is in the middle of the connector. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/023.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/024.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle, between the top and bottom of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/025.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/026.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/027.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/028.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is at the bottom.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/029.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/030.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/031.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/032.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle, between the top and bottom of the image. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/033.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/034.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. It is positioned in the middle of the image, vertically. The cable is not broken, and there is only one cable visible. The connector is the same size, and it is not possible to determine if the cable is broken or not from the image alone.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/035.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/036.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/037.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/038.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/039.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/040.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is at the bottom.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/041.png": "The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the top middle of the connectors. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/042.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/043.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/044.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is at the bottom. The connectors are not the same size; one is larger and the other is smaller.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/045.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. It is positioned in the top middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/046.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/047.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/048.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/049.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is at the bottom. The connectors are not the same size; one is larger and the other is smaller.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/050.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/051.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/052.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/053.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/054.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/055.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/056.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/057.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/058.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/059.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/060.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is at the bottom. The connectors are not the same size; one is larger and the other is smaller. patch descriptions: The image contains a single connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/061.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/062.png": "The image contains a single connector. The cable is in the vertical position, which is in the middle of the connector. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/063.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/064.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/065.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/066.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/067.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/068.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/069.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/070.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/071.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/072.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/073.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/074.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/075.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the top middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/076.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/077.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the top middle. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/078.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/079.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains multiple connectors. There are two connectors. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/080.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/081.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains one connector. The vertical position of the cable is at the bottom.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/082.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle, between the top and bottom of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/083.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/084.png": "The image contains a single connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/085.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/086.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the top middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/087.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is orange. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/088.png": "The image contains a single connector. The vertical position of the cable is at the top. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/089.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/090.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/091.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/092.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/093.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/094.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/095.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/096.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the top middle of the connectors. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is at the bottom.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/097.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/098.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains a single yellow cable with a connector. The vertical position of the cable is in the middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/099.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/100.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/101.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/102.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle, between the top and bottom of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/103.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/104.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/105.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/106.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/107.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle, between the top and bottom connectors. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/108.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle, between the top and bottom of the image. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/109.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is at the bottom. The connectors are not the same size; one is larger and the other is smaller.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/110.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/111.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/112.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are three connectors visible. There are two cables, one on the left and one on the right. The cable on the left appears to be intact, while the cable on the right is broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/113.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single yellow cable with a connector. The vertical position of the cable is in the middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/114.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/115.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/116.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/117.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/good/118.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/000.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/001.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/002.png": "The image contains multiple connectors. There are two connectors. There are two cables. One of the cables is broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/003.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/004.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are three connectors visible. There are two cables, and they are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/005.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. One of the cables is broken. The connectors are of different sizes. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/006.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/007.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/008.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/009.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/010.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/011.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is at the bottom.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/012.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/013.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/014.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/015.png": "The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/016.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/017.png": "The image contains a single connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/018.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the bottom middle of the image. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/019.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/020.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/021.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are four connectors visible. There are two cables, and they are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are three connectors visible. There are two cables, and they are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/022.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. It is positioned in the top middle of the image. patch descriptions: The image contains multiple connectors. There are three connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/023.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. It is positioned in the top middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/024.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are three connectors visible. There are two cables, and they are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/025.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. It is positioned in the top middle of the image. patch descriptions: The image contains multiple connectors. There are three connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/026.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are four connectors visible. There are two cables, and they are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/027.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are four connectors visible. There are two cables, and they are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are three connectors visible. There are two cables, and they are not broken. The vertical position of the cables is at the top middle of the connectors. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/028.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. It is positioned in the top middle of the image. patch descriptions: The image contains multiple connectors. There are three connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/029.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. It is positioned in the top middle of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/030.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. It is positioned in the top middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/031.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. It is positioned in the top middle of the image. patch descriptions: The image contains only one connector. It is positioned in the top middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/032.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are three connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. It is positioned in the top middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/033.png": "The image shows a close-up of a metal mesh with a pattern of interconnected lines. There are no connectors or cables visible in this image. Therefore, I cannot answer any questions about connectors, cables, or their positions. If you have a different image with connectors and cables, please provide it for me to assist you. patch descriptions: The image shows a pattern of connectors, but it does not depict actual connectors or cables. It appears to be a digital or graphic representation of a pattern that could be used for a cable or a similar object. Therefore, I cannot answer questions about the vertical position of a cable, the number of connectors, the number of cables, or the condition of the cables, as these are not applicable to the image provided. patch descriptions: The image shows a pattern of connectors, but it is not clear whether there is a cable or not. If there is a cable, it is not visible in the image provided. Therefore, I cannot answer the questions about the vertical position of the cable, the number of connectors, the number of cables, or the condition of the cable. If you can provide a clearer image or more information, I would be able to assist you further.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/034.png": "The image shows a close-up of a metal mesh with a pattern of hexagons. There are no connectors or cables visible in this image. Therefore, I cannot answer any questions about connectors, cables, or their positions. patch descriptions: The image shows a close-up of a metal mesh with a pattern of interconnected loops. There is no cable or connector visible in this image. If you have a different image with connectors and cables, please provide that image for me to answer your questions. patch descriptions: The image shows a close-up of a metal mesh with a pattern of interconnected loops. There is no cable or connector visible in this image. If you have a different image with connectors and cables, please provide that image for me to answer your questions.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/035.png": "The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/036.png": "The image contains a single connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/037.png": "The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains only one connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle of the image.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/038.png": "The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/039.png": "The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/040.png": "The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/041.png": "The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/042.png": "The image contains a single connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/043.png": "The image contains a single connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/044.png": "The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/045.png": "The image contains only one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/046.png": "The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is in the top middle of the image. The connectors are not the same size; one is larger and the other is smaller.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/047.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/048.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/049.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/050.png": "The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/051.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/052.png": "The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/053.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/054.png": "The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/055.png": "The image contains a single connector. It is positioned in the middle of the image, horizontally. patch descriptions: The image contains one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/056.png": "The image contains a single connector. The vertical position of the cable is at the top. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/057.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/058.png": "The image contains a single connector. It is positioned in the middle of the image, horizontally. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains one connector. The vertical position of the cable is in the top middle of the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/059.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/060.png": "The image contains a single connector. The vertical position of the cable is at the top. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/061.png": "The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the bottom middle of the image. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/062.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/063.png": "The image contains a single connector. It is positioned in the middle of the image, vertically. There is no cable visible in the image. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/064.png": "The image contains a single connector. It is positioned in the middle of the image, vertically. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/065.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle, between the top and bottom of the image. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/066.png": "The image contains a single connector. It is positioned in the middle of the image, horizontally. patch descriptions: The image contains a single connector. The vertical position of the cable is at the bottom middle of the connector. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/067.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/068.png": "The image contains a single connector. It is positioned in the middle of the image, vertically. There is no cable visible in the image. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/069.png": "The image contains a single connector. It is positioned in the middle of the image, horizontally. There is no cable visible in the image. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the bottom middle of the image. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/070.png": "The image contains a single connector. It is positioned in the middle of the image, horizontally. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/071.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/072.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains one connector. The vertical position of the cable is at the bottom. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/073.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/074.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains only one connector, which is an orange cable. It is positioned in the middle of the image, vertically.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/075.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/076.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/077.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle of the connector. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the top middle of the connectors. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/078.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the top middle. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/079.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/080.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/081.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/082.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/083.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/084.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/085.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the bottom middle of the image. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/086.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is in the bottom middle of the image. The connectors are not the same size; one is larger and the other is smaller. patch descriptions: The image contains multiple connectors. There are two connectors. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/087.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is at the bottom middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/088.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/089.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/090.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/091.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/092.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/093.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/094.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is connected to both connectors. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the top middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/095.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/096.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/097.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/098.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/099.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/100.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/101.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/102.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is at the bottom. The connectors are not the same size; one is larger and the other is smaller.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/103.png": "The image contains multiple connectors. There are two connectors. There are two cables. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/104.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle. patch descriptions: The image contains only one connector. The vertical position of the cable is in the middle.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/105.png": "The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains multiple connectors. There are two connectors. There are two cables. The cables are not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The connectors are of the same size.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/106.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is not broken. The vertical position of the cable is in the middle. The connectors are of the same size. patch descriptions: The image contains multiple connectors. There are two connectors. There is one cable, which is blue. The vertical position of the cable is at the bottom. The connectors are not the same size; one is larger and the other is smaller.", "datasets/MVTec_Loco/original/splicing_connectors/test/logical_anomalies/107.png": "The image contains multiple connectors. There are two connectors. There is one cable. The cable is not broken. The connectors are of the same size. patch descriptions: The image contains a single connector. The vertical position of the cable is in the middle. patch descriptions: The image contains a single connector. The vertical position of the cable is in the bottom middle of the image."}