{"datasets/MVTec_Loco/original/screw_bag/train/good/039.png": "patch descriptions: washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt. patch descriptions: nut, patch descriptions: nut", "datasets/MVTec_Loco/original/screw_bag/test/good/000.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the length of the longer bolt., patch descriptions: nut, patch descriptions: washer", "datasets/MVTec_Loco/original/screw_bag/test/good/001.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/002.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/003.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/004.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/005.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. Both bolts appear to be of the same length, so there is no shorter bolt to compare.", "datasets/MVTec_Loco/original/screw_bag/test/good/006.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/007.png": ", patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are multiple objects. \n\nThere are 2 bolts. \n\nThe length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/008.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/009.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/010.png": ", patch descriptions: Washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/011.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are multiple objects. \n\nThere are two bolts. The shorter bolt is approximately 1/2 the length of the longer bolt, including its head.", "datasets/MVTec_Loco/original/screw_bag/test/good/012.png": ", patch descriptions: Washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/013.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/014.png": ", patch descriptions: nut, patch descriptions: nut, patch descriptions: Washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/015.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/016.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects. There is 1 bolt that is shorter. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/017.png": ", patch descriptions: Washer, patch descriptions: Nut, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/018.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: There are multiple objects.\nThere are two bolts.\nThe shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/019.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: There are multiple objects.\nThere are two bolts.\nThe shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/020.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/021.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: - How many bolts are there? Two.\n- Describe the length of the shorter bolt including head using the longer bolt as reference: The shorter bolt is approximately 3/4 of the longer bolt in length.", "datasets/MVTec_Loco/original/screw_bag/test/good/022.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is roughly 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/023.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are multiple objects.\nThere are 2 bolts.\nThe length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/024.png": ", patch descriptions: Washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt, including the head, appears to be approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/025.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: Washer, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/026.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 2 bolts. The length of the shorter bolt including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/027.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/029.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are 2 bolts. The length of the shorter bolt including the head is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/030.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/031.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/032.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/034.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/035.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately half of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/036.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are 2 bolts. The shorter bolt is about 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/037.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/038.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts.\nThe shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/039.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/040.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts.\nThe shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/041.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects. \n\nThere are two bolts. \n\nBoth bolts have the same length.", "datasets/MVTec_Loco/original/screw_bag/test/good/042.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: Washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is about 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/043.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/044.png": ", patch descriptions: nut, patch descriptions: Washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/045.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/046.png": ", patch descriptions: nut, patch descriptions: Washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/047.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolts are approximately 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/048.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/049.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/050.png": ", patch descriptions: Nut, patch descriptions: Nut, patch descriptions: Washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/051.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/054.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: There are no bolts in the image., patch descriptions: nut, patch descriptions: nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/055.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/056.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/058.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/059.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/061.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/062.png": ", patch descriptions: Washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/063.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: - There are two bolts.\n- The shorter bolt is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/064.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: The shorter bolt is 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/065.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/066.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/067.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are multiple objects.\nThere are two bolts.\nThe shorter bolt is approximately 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/068.png": ", patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt has a length of approximately 3/4 of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/071.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are multiple objects.\nThere are two bolts.\nThe shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/072.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/073.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is about 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/074.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/076.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/078.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 1/2 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/080.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/081.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/082.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 2 bolts. The shorter bolts are 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/083.png": ", patch descriptions: nut, patch descriptions: Washer, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There is one bolt. The length of the shorter bolt, including the head, is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/085.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/086.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are multiple objects.\nThere are 2 bolts.\nThe shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/087.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There are 2 bolts. The length of the shorter bolts including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/088.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 of the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/089.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/090.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/091.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/093.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/094.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/096.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/097.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/098.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are multiple objects. \n\nThere are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/100.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/102.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/103.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/105.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/109.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/110.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/111.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/112.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/113.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There is one bolt. The shorter bolts are approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/114.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/116.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/117.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/118.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/119.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/121.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are no bolts in the image., patch descriptions: There are 2 bolts. The shorter bolt is not present; both bolts appear to be the same length.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/000.png": ", patch descriptions: nut, patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/001.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is about 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/002.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/003.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are multiple objects. There are 2 bolts. The shorter bolt is 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/004.png": ", patch descriptions: nut, patch descriptions: nut, patch descriptions: Washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is about 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/005.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is about 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/006.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are multiple objects.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/007.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple objects.\nThere are 2 bolts.\nThere is no shorter bolt to compare in this image. Both bolts appear to be of the same length.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/008.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: How many bolts are there? 2\n\nDescribe the length of the shorter bolt including the head using the longer bolt as reference: Both bolts appear to be of the same length.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/009.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/010.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt cannot be described using the longer bolt as a reference, as both bolts appear to be of the same length.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/011.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/012.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects. There are 2 bolts. The length of the shorter bolt is 1 of the longer bolt (both bolts appear to be of the same length).", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/013.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/014.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/015.png": ", patch descriptions: Washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are multiple objects. There are 2 bolts. The length of the shorter bolt including the head is approximately 1/2 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/016.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/017.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: 'There are two bolts. The shorter bolt appears to be approximately 3/4 the length of the longer bolt, including the head.'", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/018.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/019.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/020.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are multiple objects. \n\nThere are 2 bolts. \n\nThe shorter bolts are not present; both bolts are of the same length.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/021.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/022.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt appears to be approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/023.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 1/2 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/024.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 2 bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/025.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/026.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 2 bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/027.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/028.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/029.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolts including the head is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/030.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/031.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 2 bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/032.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There are two bolts. The shorter bolt's length including the head is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/033.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: 'There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.'", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/034.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/035.png": ", patch descriptions: nut, patch descriptions: Washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/036.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt appears to be about 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/037.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/038.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/039.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are 2 bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/040.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The lengths of the shorter bolts, including the head, are each half the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/041.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects.\n\nThere are 2 bolts.\n\nThe shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/042.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolts are approximately 1/2 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/043.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/044.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolts including the head is the same as the longer bolt, so each is 1 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/045.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/046.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are three bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/047.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt (including head).", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/048.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/049.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are three bolts. The length of the shorter bolts, including the head, is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/050.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are three bolts. The shorter bolts are approximately 1/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/051.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/052.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are 3 bolts. The shorter bolts, including the head, are 1/2 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/053.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/054.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 1/2 the length of the longer bolt when including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/055.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are 2 bolts. The shorter bolt is about 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/056.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: There are multiple objects.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/057.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/058.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 3 bolts. The shorter bolt is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/059.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 3 bolts.\nThe length of the shorter bolts including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/060.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are three bolts. The shorter bolts are 1/2 the length of the longer bolt (including the head).", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/061.png": ", patch descriptions: Washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/062.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/063.png": ", patch descriptions: Nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: Washer, patch descriptions: There are two bolts. The shorter bolt is about 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/064.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are three bolts. The length of the shorter bolts, including the head, is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/065.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There is 1 bolt. There are no shorter bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/066.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/067.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/068.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/069.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are two bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/070.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There is one bolt.\nThere is no shorter bolt in the image.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/071.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is about 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/072.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts.\nThe shorter bolt is approximately 3/4 the length of the longer bolt, including its head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/073.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/074.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are no bolts., patch descriptions: There is 1 bolt.\nThere are no shorter bolts to describe.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/075.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There is 1 bolt.\nThere are no shorter bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/076.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/077.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/078.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/079.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/080.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/081.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There is 1 bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/082.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/083.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/084.png": ", patch descriptions: Nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/085.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There is 1 bolt. The image contains multiple objects, so I will answer the other questions:\n\nThere is 1 bolt.\n\nThere is no shorter bolt in the image, so the second question doesn't apply.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/086.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt, including the head, is about 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/087.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple objects. \n\nThere are two bolts, and the length of the shorter bolt including the head is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/088.png": ", patch descriptions: Washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/089.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are multiple objects. \nThere are 2 bolts. \nThe length of the shorter bolt including the head is about 1/2 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/090.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/091.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/092.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately 1/2 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/093.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects. There are four bolts. The length of the shorter bolts, including the head, is approximately 1/2 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/094.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/096.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/101.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: Washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt including the head is approximately half (1/2) the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/103.png": ", patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/107.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Washer, patch descriptions: nut, patch descriptions: There are multiple objects.\nThere is 1 bolt.\nThere are no shorter bolts.\n, patch descriptions: There are two bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/113.png": ", patch descriptions: Nut, patch descriptions: Nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects. \n\nThere are two bolts. The shorter bolt is approximately 1/2 the length of the longer bolt when including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/114.png": ", patch descriptions: nut, patch descriptions: Nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is about 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/115.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/116.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/117.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There is 1 bolt. The length of the shorter bolt, including the head, is 1/2 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/118.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/119.png": ", patch descriptions: nut, patch descriptions: There are no bolts in the image., patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt when including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/120.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/121.png": ", patch descriptions: Nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/122.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt including its head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/123.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/124.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: Washer, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/125.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: - There are 2 bolts.\n- Both bolts appear to be of the same length.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/126.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/127.png": ", patch descriptions: nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/128.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt when including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/129.png": ", patch descriptions: Nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are 2 bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/130.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/131.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are 2 bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/132.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are multiple objects. There are three bolts. The length of the shorter bolts including the head is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/133.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are multiple objects.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/134.png": ", patch descriptions: nut, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: Nut, patch descriptions: There are multiple objects.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/135.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are multiple objects. There is 1 bolt. There are no shorter bolts to describe.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/136.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 1/2 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/028.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/033.png": ", patch descriptions: nut, patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are 2 bolts. The shorter bolts are approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/052.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are multiple objects. There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/053.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/057.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: There are multiple objects. There are 2 bolts in the image. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/060.png": ", patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/069.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/070.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolts are approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/075.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are multiple objects. There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/077.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are 2 bolts. The length of the shorter bolt, including the head, is approximately half (1/2) the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/079.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are 2 bolts.", "datasets/MVTec_Loco/original/screw_bag/test/good/084.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/092.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/095.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple objects. \n\nThere are 2 bolts. \n\nThe shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/099.png": ", patch descriptions: nut, patch descriptions: nut, patch descriptions: Washer, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 1/2 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/101.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are multiple objects. There are 2 bolts. The length of the shorter bolt, including the head, is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/104.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/good/106.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/107.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The length of the shorter bolt including the head is approximately 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/108.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are 2 bolts.", "datasets/MVTec_Loco/original/screw_bag/test/good/115.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There is 1 bolt. The shorter bolt including head is 3/4 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/good/120.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The lengths of both bolts are the same.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/095.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are 2 bolts. The length of the shorter bolt including the head is approximately 1/2 of the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/097.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/098.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt if you include the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/099.png": ", patch descriptions: Nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 1/2 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/100.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolt's length, including the head, is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/102.png": ", patch descriptions: washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolts are approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/104.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are two bolts. The shorter bolts are approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/105.png": ", patch descriptions: washer, patch descriptions: Washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are multiple objects. There are two bolts. The length of the shorter bolt including the head is approximately 3/4 the length of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/106.png": ", patch descriptions: washer, patch descriptions: Nut, patch descriptions: nut, patch descriptions: There are two bolts.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/108.png": ", patch descriptions: Washer, patch descriptions: washer, patch descriptions: nut, patch descriptions: Nut, patch descriptions: There are multiple objects. There are 2 bolts. The length of the shorter bolts including the head is approximately 1/2 of the longer bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/109.png": ", patch descriptions: Nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are multiple objects. There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt when including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/110.png": ", patch descriptions: washer, patch descriptions: nut, patch descriptions: washer, patch descriptions: Nut, patch descriptions: There is one bolt.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/111.png": ", patch descriptions: nut, patch descriptions: nut, patch descriptions: washer, patch descriptions: There are two bolts. The shorter bolt is approximately 3/4 the length of the longer bolt, including the head.", "datasets/MVTec_Loco/original/screw_bag/test/logical_anomalies/112.png": ", patch descriptions: nut, patch descriptions: washer, patch descriptions: nut, patch descriptions: There are 2 bolts. The shorter bolt is approximately 3/4 the length of the longer bolt including the head."}